package ru.isalnikov.sportloto;

/**
 *
 * Вам как опытному программисту поставили задачу :  
 * разработать сервис коротких ссылок , который мог бы : 
 * 1) преобразовывать  ссылки в короткие значения 
 * 2) по короткому значению делать редирект на исходный ресурс 
 * 3) вести статистику переходов по ссылкам.
 *
 * Нужно : -
 *
 * 1)оценить сроки 
 * 2)придумать архитектуру (какой язык,сервер, какая база,  модель базы данных, поля, значения итд) 
 * 2.1)какой набор символов будет оптимальный? 
 * 3)дать возможность человеку который создал короткую ссылку -  смотреть по ней статистику переходов (и не давать если это не автор ссылки ,
 * нужно предложить способ реализовать без авторизации на сайте) 
 * 4) если человек постит короктую ссылку в несколько аккаунтов - дать ему возможность смотреть   статистику по разным аккаунтам. 
 * 5)Если пользователь орубликовал ссылку в  своем блоке а по ней переходят 100500 пользователей сразу после публикации,  как организовать сбор статистики.
 */
public class ShortenerService {
//https://dzone.com/articles/url-shortener-service-42-lines
    
    
    //Character character = new Character();
   
}
